driver-tests/bpelse/xpathfunctions/XPathFunctionsJbi/test/current-dateTime/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cur="http://stc.com/current-dateTime">
  <soapenv:Body>
    <cur:item>
      <cur:value>Get Current Date Time</cur:value>
    </cur:item>
  </soapenv:Body>
</soapenv:Envelope>